In [2]:
import pandas as pd
import pyodbc # python object database connectivity
import warnings
import platform
import os
warnings.filterwarnings("ignore")

In [2]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'ODBC Driver 17 for SQL Server']

In [3]:
platform.node()

'DESKTOP-NAKP5E5'

* driver
* host
* database
* trusted_connection

In [4]:
connection = pyodbc.connect(driver = "{ODBC Driver 17 for SQL Server}",
                           host = platform.node(), database = "KnowledgeHut",
                           trusted_connection='yes')

In [5]:
connection

In [6]:
# reading the data from database

In [7]:
sql_query = "select * from employee"

In [8]:
df = pd.read_sql(sql=sql_query, con =  connection)

In [9]:
df.shape

(30, 14)

In [10]:
df.head()

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
0,5.0,Max,George,26.0,M,Sales,Sales,1300.0,200.0,150.0,Max@company.com,California,2638 Richards Avenue,1.0
1,13.0,Katty,Bond,56.0,F,Manager,Management,150000.0,0.0,300.0,Katty@company.com,Arizona,None,1.0
2,11.0,Richerd,Gear,57.0,M,Manager,Management,250000.0,0.0,300.0,Richerd@company.com,Alabama,None,1.0
3,10.0,Jennifer,Dion,34.0,F,Sales,Sales,1000.0,200.0,150.0,Jennifer@company.com,Alabama,None,13.0
4,19.0,George,Joe,50.0,M,Manager,Management,100000.0,0.0,300.0,George@company.com,Florida,1003 Wyatt Street,1.0

In [11]:
df1 = pd.read_sql(sql="select * from employee where department = 'Sales'", con = connection)

In [13]:
df1['department'].unique()

array(['Sales'], dtype=object)

In [15]:
os.mkdir("Kaushal")

In [5]:
fldpath = os.getcwd() + "\\" + "Kaushal"

In [6]:
fldpath

'C:\\Users\\AEPAC\\Desktop\\KnowledgeHut\\2024\\2024_KnowledgeHut\\Data Analyst (MID - 14th Sep)\\Python\\20th - Oct Python Pandas - Numpy - Visualization\\Kaushal'

In [7]:
sales = pd.read_csv("Superstore.csv", encoding="ISO-8859-1")

In [8]:
sales.shape

(9994, 21)

In [9]:
for st in sales.State.unique():
    result = sales[sales["State"] == st]
    result.to_csv(fldpath + "\\" + st + ".csv", index = False)

In [10]:
import sqlalchemy

In [11]:
print("All the files names: \n", os.listdir(fldpath))

All the files names:
 ['Alabama.csv', 'Arizona.csv', 'Arkansas.csv', 'California.csv', 'Colorado.csv', 'Connecticut.csv', 'Delaware.csv', 'District of Columbia.csv', 'Florida.csv', 'Georgia.csv', 'Idaho.csv', 'Illinois.csv', 'Indiana.csv', 'Iowa.csv', 'Kansas.csv', 'Kentucky.csv', 'Louisiana.csv', 'Maine.csv', 'Maryland.csv', 'Massachusetts.csv', 'Michigan.csv', 'Minnesota.csv', 'Mississippi.csv', 'Missouri.csv', 'Montana.csv', 'Nebraska.csv', 'Nevada.csv', 'New Hampshire.csv', 'New Jersey.csv', 'New Mexico.csv', 'New York.csv', 'North Carolina.csv', 'North Dakota.csv', 'Ohio.csv', 'Oklahoma.csv', 'Oregon.csv', 'Pennsylvania.csv', 'Rhode Island.csv', 'South Carolina.csv', 'South Dakota.csv', 'Tennessee.csv', 'Texas.csv', 'Utah.csv', 'Vermont.csv', 'Virginia.csv', 'Washington.csv', 'West Virginia.csv', 'Wisconsin.csv', 'Wyoming.csv']

In [12]:
# connect with sql with python using sqlalchemy

In [27]:
import pandas as pd
from sqlalchemy import create_engine

# Define the SQL Server connection string using Windows Authentication
server = platform.node()
database = 'KnowledgeHut'

# Create the SQLAlchemy engine with a trusted connection
engine = create_engine(f"mssql+pyodbc://@{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes")

In [32]:
for fl in os.listdir(fldpath):
    df = pd.read_csv(fldpath + "\\" + fl)
    df.to_sql("salesData1", con = engine , if_exists='append', index = False)